{
  "last_node_id": 32,
  "last_link_id": 15,
  "nodes": [
    {
      "id": 3,
      "type": "ShowText|pysssss",
      "pos": [
        987,
        283
      ],
      "size": [
        276.55195436012696,
        876
      ],
      "flags": {},
      "order": 2,
      "mode": 0,
      "inputs": [
        {
          "name": "text",
          "type": "STRING",
          "link": 4,
          "widget": {
            "name": "text"
          },
          "label": "文本"
        }
      ],
      "outputs": [
        {
          "name": "STRING",
          "type": "STRING",
          "links": [
            5,
            14
          ],
          "shape": 6,
          "label": "字符串",
          "slot_index": 0
        }
      ],
      "properties": {
        "Node name for S&R": "ShowText|pysssss"
      },
      "widgets_values": [
        "",
        "This is a digitally created image that depicts a fantastical scene. In the foreground, there's a young girl dressed in an elegant white outfit with golden details, sitting calmly on a rock. Her attire includes a fur-trimmed cloak and a belt with a prominent gold buckle. The girl has blonde hair and is wearing simple white sneakers.Behind her, two dragons are present. To the left, there's a smaller dragon with orange scales and its mouth open as if it's roaring or breathing fire. To the right stands a much larger white dragon with intricate detailing on its scales, wings, and sharp horns. This dragon appears more majestic and regal, with its mouth slightly open and eyes focused forward.The setting seems to be a cavernous environment with towering walls that have jagged edges. The lighting in the scene is dramatic, with warm tones illuminating the background, creating a contrast with the cooler colors of the characters and the girl's clothing. There's also a sense of mist or smoke rising from the ground, adding to the mystical atmosphere of the image.",
        "This is a digitally created image that depicts a fantastical scene. In the foreground, there's a young girl with platinum blonde hair dressed in an elegant white outfit adorned with golden embroidery. The attire suggests a regal or noble status. She is seated on rocky ground and appears contemplative or perhaps waiting for something.Behind her, dominating the mid-ground, is a magnificent white dragon. The dragon has detailed scales, sharp claws, and its mouth slightly open revealing its teeth. Its eyes are fierce yet calm, and it seems protective or guarding of the young girl. The dragon's posture is relaxed but powerful, with one claw gently resting on the rock where the girl is sitting.The background features a dramatic landscape. There are rugged mountains with one appearing particularly prominent in the distance. The sky above is painted with hues of orange and red, suggesting either a sunrise or sunset. Between the mountains, there appears to be a fiery volcanic activity with lava flowing, adding to the dramatic and otherworldly atmosphere of the scene.Overall, the image evokes a sense of fantasy adventure, protection, and serenity. It combines elements often found in mythical tales – a brave princess accompanied by her loyal dragon against a backdrop of mystical lands.",
        "This is a digitally created image that depicts a fantastical scene. In the center, there's a young girl dressed in a white fur-trimmed robe with golden embroidery on the chest, sitting calmly between two large white dragons. The girl has blonde hair and is wearing white boots. Both dragons have sharp teeth bared, fierce expressions, and their scales are intricately detailed. They appear to be coiled around her protectively or perhaps guarding her. The backdrop reveals a dramatic landscape with red rock formations and what seems like lava flowing in the distance, suggesting a volcanic environment. The lighting in the scene is warm, with a soft glow that contrasts with the fiery background, highlighting the central figures and giving the image a mystical atmosphere.",
        "This is a fantastical digital artwork depicting two large, white dragons with intricate scales and textures. They are situated in a rugged, rocky landscape that appears to be volcanic, given the glowing red rock formations in the background under an orange-hued sky, suggesting either sunrise or sunset. In the foreground, a young girl sits calmly on the back of one dragon, her relaxed posture indicating trust and familiarity with these mythical creatures. She wears a simple, elegant white dress complemented by a thin golden belt around her waist, which adds a touch of humanity to the scene filled with fantasy elements. The contrast between the fiery environment and the cool, serene demeanor of both the dragons and the child creates a compelling juxtaposition within the image.",
        "This is a digitally created image that depicts a fantastical scene. At the center, there's a young girl dressed in a white dress with golden details, seated calmly on a rock. She has long blonde hair and is wearing white boots. The two main subjects of the image are the two majestic white dragons flanking her. They have intricate scales, sharp claws, and fierce expressions with their mouths open, revealing their teeth. The dragons exude an aura of power and grace. In the background, we can see a dramatic landscape featuring what appears to be a volcanic eruption with lava flowing, adding to the otherworldly atmosphere of the scene. The lighting in the image is dramatic, highlighting the central figures and creating a contrast between the warmth of the lava and the cooler tones of the characters and surroundings.",
        "This is a digitally created image that depicts a fantastical scene. In the foreground, there's a young girl dressed in an elegant white dress with golden embellishments on the bodice and waistband, paired with matching boots. Her attire suggests a sense of royalty or high status. The girl sits calmly on a large rock, her pose relaxed yet regal.Behind the girl, dominating the background, is a magnificent white dragon. Its scales are intricately detailed, with textures that suggest both smoothness and roughness. The dragon's wings are expansive and feathered, adding to its majestic appearance. It has its mouth open slightly, revealing sharp teeth, but there's no sign of aggression; instead, it exudes a protective or guardian-like presence.The setting appears to be a rugged mountainous terrain with steep cliffs in the distance. There's a fiery explosion or eruption taking place in the far background, emitting plumes of smoke and fire, which contrasts starkly with the cool and serene demeanor of the characters in the foreground. The lighting in the scene is dramatic, with highlights and shadows that accentuate the depth and drama of the composition. Overall, the image evokes a narrative of fantasy, power, and perhaps a bond between the young girl and the dragon.",
        "This is a digitally created image that depicts a fantastical scene. In the center, there's a young girl seated on what appears to be a rock or a piece of debris. She has long hair and is dressed in an elaborate costume that includes a white fur-trimmed cloak with golden embroidery, matching white pants, and boots with gold accents. The attire suggests a regal or noble status, perhaps that of a princess or a character of significance within a fantasy narrative.Flanking the girl are two magnificent white dragons. They have intricate scales and sharp features, with their mouths slightly open as if they are roaring or preparing to breathe fire. Their eyes glow with an intense orange light, which contrasts with their pure white scales. The dragons appear to be protectors or guardians of the girl, adding to the mystique and power of the central figure.The background is fiery, with lava flowing and smoke rising, suggesting that the location might be near a volcanic region or that the scene represents a battleground or a place of great conflict. The warm tones of the background juxtapose sharply with the cool white of the dragons and the girl's clothing, creating a dramatic and vivid visual effect.Overall, the image evokes a sense of epic fantasy, where mythical creatures coexist with human characters, possibly hinting at a story of courage, magic, and alliance between different beings."
      ],
      "category": "Custom Nodes"
    },
    {
      "id": 8,
      "type": "ZhipuaiApi_img",
      "pos": [
        521,
        326
      ],
      "size": {
        "0": 400,
        "1": 200
      },
      "flags": {},
      "order": 1,
      "mode": 0,
      "inputs": [
        {
          "name": "image",
          "type": "IMAGE",
          "link": 9,
          "label": "image"
        }
      ],
      "outputs": [
        {
          "name": "text",
          "type": "STRING",
          "links": [
            4
          ],
          "shape": 3,
          "label": "text",
          "slot_index": 0
        }
      ],
      "properties": {
        "Node name for S&R": "ZhipuaiApi_img"
      },
      "widgets_values": [
        "Describe this image",
        1024,
        0.8,
        "English",
        true
      ]
    },
    {
      "id": 9,
      "type": "SaveText|pysssss",
      "pos": [
        1780,
        296
      ],
      "size": [
        400,
        200
      ],
      "flags": {},
      "order": 3,
      "mode": 0,
      "inputs": [
        {
          "name": "text",
          "type": "STRING",
          "link": 5,
          "widget": {
            "name": "text"
          },
          "label": "文本"
        }
      ],
      "outputs": [
        {
          "name": "STRING",
          "type": "STRING",
          "links": [],
          "shape": 3,
          "slot_index": 0
        }
      ],
      "properties": {
        "Node name for S&R": "SaveText|pysssss"
      },
      "widgets_values": [
        "input",
        "file.txt",
        "overwrite",
        false,
        "",
        true
      ],
      "category": "Custom Nodes"
    },
    {
      "id": 17,
      "type": "LoadImageListFromDir //Inspire",
      "pos": [
        -10,
        321
      ],
      "size": {
        "0": 315,
        "1": 150
      },
      "flags": {},
      "order": 0,
      "mode": 0,
      "outputs": [
        {
          "name": "IMAGE",
          "type": "IMAGE",
          "links": [
            9
          ],
          "shape": 6,
          "label": "图像",
          "slot_index": 0
        },
        {
          "name": "MASK",
          "type": "MASK",
          "links": null,
          "shape": 6,
          "label": "遮罩"
        }
      ],
      "properties": {
        "Node name for S&R": "LoadImageListFromDir //Inspire"
      },
      "widgets_values": [
        "E:\\work\\AIchild",
        0,
        0,
        false
      ],
      "category": "Custom Nodes"
    },
    {
      "id": 25,
      "type": "CR Save Text To File",
      "pos": [
        1579,
        614
      ],
      "size": [
        400,
        200
      ],
      "flags": {},
      "order": 4,
      "mode": 0,
      "inputs": [
        {
          "name": "multiline_text",
          "type": "STRING",
          "link": 14,
          "widget": {
            "name": "multiline_text"
          },
          "label": "多行文本"
        }
      ],
      "outputs": [
        {
          "name": "show_help",
          "type": "STRING",
          "links": [],
          "shape": 3,
          "slot_index": 0
        }
      ],
      "properties": {
        "Node name for S&R": "CR Save Text To File"
      },
      "widgets_values": [
        "",
        "E:\\work\\AIchild",
        "pic",
        "txt",
        true
      ],
      "category": "Custom Nodes"
    }
  ],
  "links": [
    [
      4,
      8,
      0,
      3,
      0,
      "STRING"
    ],
    [
      5,
      3,
      0,
      9,
      0,
      "STRING"
    ],
    [
      9,
      17,
      0,
      8,
      0,
      "IMAGE"
    ],
    [
      14,
      3,
      0,
      25,
      0,
      "STRING"
    ]
  ],
  "groups": [],
  "config": {},
  "extra": {
    "ds": {
      "scale": 0.9090909090909091,
      "offset": [
        -248.4228347265042,
        -109.98768603919555
      ]
    }
  },
  "version": 0.4
}